In [1]:
import pandas as pd
import numpy as np

In [2]:
# Creating  a DataFrame Object form a 2-D dictionary

In [3]:
dict1 ={'students': ['Ruchilka','Neha','Mark','Gurjoyt','Jamaal'],
       'Marks':[79.5,83.75,74,88.5, 89],
       'Sport':['Cricket','Badmintoon','Football','Athelectics','Kabaddi']}
dict1

{'students': ['Ruchilka', 'Neha', 'Mark', 'Gurjoyt', 'Jamaal'],
 'Marks': [79.5, 83.75, 74, 88.5, 89],
 'Sport': ['Cricket', 'Badmintoon', 'Football', 'Athelectics', 'Kabaddi']}

In [4]:
dtf1 = pd.DataFrame(dict1)
dtf1

   students  Marks        Sport
0  Ruchilka  79.50      Cricket
1      Neha  83.75   Badmintoon
2      Mark  74.00     Football
3   Gurjoyt  88.50  Athelectics
4    Jamaal  89.00      Kabaddi

In [5]:
# Assisning index to the dataframe
dtf2 = pd.DataFrame(dict1, index =['I','II','III','IV','V'])
dtf2

     students  Marks        Sport
I    Ruchilka  79.50      Cricket
II       Neha  83.75   Badmintoon
III      Mark  74.00     Football
IV    Gurjoyt  88.50  Athelectics
V      Jamaal  89.00      Kabaddi

In [6]:
dtf2 = pd.DataFrame(dict1, index =['I','II','III','IV','V','VI'])

ValueError: Length of values (5) does not match length of index (6)

In [7]:
# example1
dict1 ={'Section':['A','B','C','D'],
       'Contri': [6700,5000, 5600, 5200]}
dict1

{'Section': ['A', 'B', 'C', 'D'], 'Contri': [6700, 5000, 5600, 5200]}

In [9]:
df1 = pd.DataFrame(dict1)
df1

  Section  Contri
0       A    6700
1       B    5000
2       C    5600
3       D    5200

In [10]:
# Creating a dataframe from a 2D dictionary having values as dictionary objects
people ={'Sales':{'name':'Rohit','age':'34','sex':'male'},
        'Markting':{'name':'Neha', 'age':'35','sex':'female'}}
pd.DataFrame(people)

      Sales Markting
name  Rohit     Neha
age      34       35
sex    male   female

In [11]:
sales ={'yr1':{'qtr1':35400,'qtr2':56000,'qtr3':75463,'qtr4':49000},
       'yr2':{'qtr1': 76473,'qtr2':76473,'qtr3':66265,'qtr4':877782}}
pd.DataFrame(sales)

        yr1     yr2
qtr1  35400   76473
qtr2  56000   76473
qtr3  75463   66265
qtr4  49000  877782

In [15]:
# Creating a DataFrame Object from a list of Dictionaries/Lists
topperA ={'RollNo':115,'Name':'Abhay','Marks':97.5}
topperB ={'RollNo':243,'Name':'Brijesh','Marks':98.5}
topperC ={'RollNo':863,'Name':'Manish','Marks':76.5}
topperD ={'RollNo':765,'Name':'Ayush','Marks':88.5}
toppers =[topperA,  topperB, topperC, topperD]

In [16]:
topdf = pd.DataFrame(toppers)
topdf

   RollNo     Name  Marks
0     115    Abhay   97.5
1     243  Brijesh   98.5
2     863   Manish   76.5
3     765    Ayush   88.5

In [17]:
pd.DataFrame(toppers, index=['SecA','SecB','SecC','SecD'])

      RollNo     Name  Marks
SecA     115    Abhay   97.5
SecB     243  Brijesh   98.5
SecC     863   Manish   76.5
SecD     765    Ayush   88.5

In [18]:
zoneA ={'Target':56000,'Sales':58000}
zoneB ={'Target':576723,'Sales':531000}
zoneC ={'Target':726000,'Sales':73000}
zoneD ={'Target':64500,'Sales':673000}
sales =[zoneA, zoneB, zoneC, zoneD]
salesdf = pd.DataFrame(sales, index =['ZoneA','ZoneB','ZoneC','ZoneD'])

In [19]:
salesdf

       Target   Sales
ZoneA   56000   58000
ZoneB  576723  531000
ZoneC  726000   73000
ZoneD   64500  673000

In [20]:
list2 =[[25,45,60],[34,67, 89],[88, 90,56]]
df1 = pd.DataFrame(list2)
df1

    0   1   2
0  25  45  60
1  34  67  89
2  88  90  56

In [21]:
df2 = pd.DataFrame(list2, index =['row1','row2','row3'])
df2

       0   1   2
row1  25  45  60
row2  34  67  89
row3  88  90  56

In [24]:
Target = [546224,42363,3462241,146562]
Sales = [256554,436643,243634,4236234]
ZoneSales = [Target, Sales]
zsaledf = pd.DataFrame(ZoneSales, columns= ['zoneA','zoneB','zoneC','zoneD'], index =['target','sales'])

In [25]:
zsaledf

         zoneA   zoneB    zoneC    zoneD
target  546224   42363  3462241   146562
sales   256554  436643   243634  4236234

In [26]:
# Creating  a dataFrame Objects from a 2D ndarray
narr1 = np.array([[1,2,3],[4,5,6]], np.int32)
narr1.shape

(2, 3)

In [28]:
dtf1 = pd.DataFrame(narr1)
dtf1

   0  1  2
0  1  2  3
1  4  5  6

In [29]:
dtf2 = pd.DataFrame(narr1, columns =['one','Two','Three'])
dtf2

   one  Two  Three
0    1    2      3
1    4    5      6

In [30]:
# creating  a DataFrame Object form a 2D Array
narr1 = np.array([[1,2,3],[4,5,6]], np.int32)
narr1.shape

(2, 3)

In [31]:
# Creating a dataFrame Object form a 2D dictionary with values as series Objects
staff = pd.Series([20,36,44])
salaries = pd.Series([166000, 246000, 563000])

In [33]:
school = {'people':staff,'Amount':salaries}
dtf4 = pd.DataFrame(school)
dtf4

   people  Amount
0      20  166000
1      36  246000
2      44  563000

In [34]:
# Creating a DataFrame object from another DataFrame object
dfnew = pd.DataFrame(dtf1)

In [35]:
dfnew

   0  1  2
0  1  2  3
1  4  5  6

In [37]:
# DataFrame Attribute

In [38]:
dfnew.index

RangeIndex(start=0, stop=2, step=1)

In [39]:
dfnew.columns

RangeIndex(start=0, stop=3, step=1)

In [40]:
dfnew.axes

[RangeIndex(start=0, stop=2, step=1), RangeIndex(start=0, stop=3, step=1)]

In [41]:
dfnew.dtypes

0    int32
1    int32
2    int32
dtype: object

In [42]:
len(dfnew)

2

In [43]:
dfnew.count

<bound method DataFrame.count of    0  1  2
0  1  2  3
1  4  5  6>

In [44]:
# Transposing a DataFrame
dfnew.T

   0  1
0  1  4
1  2  5
2  3  6